historic/moonshot-samples/C24N1/results/mixed-302-1to4k_20Mseq.fio.out
randread-1k-4k: (g=0): rw=randread, bs=1K-4K/1K-4K/1K-4K, ioengine=libaio, iodepth=10
seqread: (g=0): rw=read, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
seqwrite: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
fio-2.1.3
Starting 3 processes

randread-1k-4k: (groupid=0, jobs=1): err= 0: pid=31422: Fri May 27 18:03:55 2016
  read : io=8922.3MB, bw=152270KB/s, iops=72100, runt= 60001msec
    slat (usec): min=1, max=1796, avg= 4.36, stdev= 8.05
    clat (usec): min=1, max=82604, avg=132.91, stdev=309.72
     lat (usec): min=24, max=82606, avg=137.38, stdev=309.92
    clat percentiles (usec):
     |  1.00th=[   76],  5.00th=[   83], 10.00th=[   87], 20.00th=[   93],
     | 30.00th=[   98], 40.00th=[  103], 50.00th=[  107], 60.00th=[  112],
     | 70.00th=[  119], 80.00th=[  129], 90.00th=[  157], 95.00th=[  243],
     | 99.00th=[  660], 99.50th=[  940], 99.90th=[ 1496], 99.95th=[ 1704],
     | 99.99th=[ 9920]
    bw (KB  /s): min=25986, max=195780, per=88.12%, avg=152257.99, stdev=33952.59
    lat (usec) : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.13%, 100=32.75%
    lat (usec) : 250=62.24%, 500=3.20%, 750=0.94%, 1000=0.28%
    lat (msec) : 2=0.42%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%
  cpu          : usr=15.79%, sys=41.91%, ctx=1515656, majf=0, minf=19
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=4326128/w=0/d=0, short=r=0/w=0/d=0
seqread: (groupid=0, jobs=1): err= 0: pid=31423: Fri May 27 18:03:55 2016
  read : io=1202.0MB, bw=20513KB/s, iops=20, runt= 60002msec
    slat (usec): min=68, max=1125, avg=215.46, stdev=107.36
    clat (usec): min=486, max=60826, avg=1023.49, stdev=3078.75
     lat (usec): min=633, max=61069, avg=1239.64, stdev=3089.28
    clat percentiles (usec):
     |  1.00th=[  556],  5.00th=[  580], 10.00th=[  596], 20.00th=[  620],
     | 30.00th=[  636], 40.00th=[  652], 50.00th=[  676], 60.00th=[  700],
     | 70.00th=[  724], 80.00th=[  772], 90.00th=[  884], 95.00th=[ 1848],
     | 99.00th=[ 5600], 99.50th=[ 7520], 99.90th=[46336], 99.95th=[60672],
     | 99.99th=[60672]
    bw (KB  /s): min=20357, max=24526, per=11.88%, avg=20531.38, stdev=381.08
    lat (usec) : 500=0.08%, 750=76.04%, 1000=15.31%
    lat (msec) : 2=3.99%, 4=2.91%, 10=1.25%, 50=0.33%, 100=0.08%
  cpu          : usr=0.03%, sys=0.48%, ctx=2386, majf=0, minf=525
  IO depths    : 1=98.5%, 2=0.3%, 4=0.7%, 8=0.5%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1202/w=0/d=0, short=r=0/w=0/d=0
seqwrite: (groupid=0, jobs=1): err= 0: pid=31424: Fri May 27 18:03:55 2016
  write: io=1202.0MB, bw=20513KB/s, iops=20, runt= 60003msec
    slat (usec): min=71, max=1253, avg=247.16, stdev=116.26
    clat (usec): min=359, max=51362, avg=1331.27, stdev=3218.22
     lat (usec): min=748, max=51639, avg=1579.06, stdev=3227.77
    clat percentiles (usec):
     |  1.00th=[  660],  5.00th=[  684], 10.00th=[  692], 20.00th=[  828],
     | 30.00th=[  844], 40.00th=[  852], 50.00th=[  868], 60.00th=[  884],
     | 70.00th=[  900], 80.00th=[  916], 90.00th=[ 1064], 95.00th=[ 1672],
     | 99.00th=[17280], 99.50th=[25984], 99.90th=[40704], 99.95th=[51456],
     | 99.99th=[51456]
    bw (KB  /s): min=18962, max=24478, per=100.00%, avg=20532.01, stdev=417.67
    lat (usec) : 500=0.08%, 750=14.98%, 1000=73.38%
    lat (msec) : 2=7.07%, 4=1.33%, 10=1.66%, 20=0.83%, 50=0.58%
    lat (msec) : 100=0.08%
  cpu          : usr=0.11%, sys=0.45%, ctx=2392, majf=0, minf=9
  IO depths    : 1=98.5%, 2=0.3%, 4=0.7%, 8=0.5%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1202/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=10124MB, aggrb=172781KB/s, minb=20513KB/s, maxb=152270KB/s, mint=60001msec, maxt=60002msec
  WRITE: io=1202.0MB, aggrb=20513KB/s, minb=20513KB/s, maxb=20513KB/s, mint=60003msec, maxt=60003msec

Disk stats (read/write):
  nvme0n1: ios=4333016/10833, merge=0/0, ticks=536212/9776, in_queue=545820, util=99.90%